## Introduction to Databases

### Using SQLAlchemy 

Based in [this](https://medium.com/hacking-datascience/sqlalchemy-python-tutorial-abcc2ec77b57) and [this](https://auth0.com/blog/sqlalchemy-orm-tutorial-for-python-developers/)

SQLAlchemy provides a nice “Pythonic” way of interacting with databases. So rather than dealing with the differences between specific dialects of traditional SQL such as MySQL or PostgreSQL or Oracle, you can leverage the Pythonic framework of SQLAlchemy to streamline your workflow and more efficiently query your data.

In [16]:
#!pip install mysqlclient
#!pip install python-dotenv
#!pip install sqlalchemy

In [17]:
import os
import getpass

import pandas as pd

import sqlalchemy
from sqlalchemy import create_engine, Column, Integer, String, Sequence, Float, PrimaryKeyConstraint, ForeignKey
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker, relationship, backref

#from dotenv import load_dotenv, find_dotenv

### Connecting to a database

To start interacting with the database we first we need to establish a connection.  

Some examples of connecting to various databases can be found [here](http://docs.sqlalchemy.org/en/latest/core/engines.html#postgresql)

In [5]:
#p = getpass.getpass()

In [6]:
#engine = db.create_engine('dialect+driver://user:pass@host:port/db')

def connect_db():
    db = sqlalchemy.create_engine('sqlite:///../SampleDBs/sqlalchemydb.sqlite')
    return db

### Viewing Table Details

SQLAlchemy can be used to automatically load tables from a database using something called reflection. Reflection is the process of reading the database and building the metadata based on that information.

In [9]:
engine = sqlalchemy.create_engine('sqlite:///../SampleDBs/chinook.sqlite')
connection = engine.connect()
metadata = sqlalchemy.MetaData()
albums = sqlalchemy.Table('albums', metadata, autoload=True, autoload_with=engine)

In [10]:
# Print the column names
print(albums.columns.keys())

['AlbumId', 'Title', 'ArtistId']

In [11]:
# Print full table metadata
print(repr(metadata.tables['albums']))

Table('albums', MetaData(bind=None), Column('AlbumId', INTEGER(), table=<albums>, primary_key=True, nullable=False), Column('Title', NVARCHAR(length=160), table=<albums>, nullable=False), Column('ArtistId', INTEGER(), ForeignKey('artists.ArtistId'), table=<albums>, nullable=False), schema=None)

### Querying

ResultProxy: The object returned by the .execute() method. It can be used in a variety of ways to get the data returned by the query.  

ResultSet: The actual data asked for in the query when using a fetch method such as .fetchall() on a ResultProxy.

In [13]:
#Equivalent to 'SELECT * FROM albums'
query = sqlalchemy.select([albums])

In [14]:
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
#partial_results = ResultProxy.fetchmany(50)
ResultSet[:3]

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2)]

Convert to dataframe

In [19]:
df = pd.DataFrame(ResultSet)
df.columns = ResultSet[0].keys()
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

### Filtering data

Lets see some examples of raw SQLite Queries and queries using SQLAlchemy.

#### where

In [33]:
## SQL :SELECT * FROM artists WHERE Name = "Caetano Veloso" :

artists = sqlalchemy.Table('artists', metadata, autoload=True, autoload_with=engine)
query = sqlalchemy.select([artists]).where(artists.columns.Name == 'Caetano Veloso')
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

[(16, 'Caetano Veloso')]

#### in

In [34]:
## SQL : SELECT FirstName, LastName FROM customers WHERE state IN ("Rio de Janeiro", "New York")

customers = sqlalchemy.Table('customers', metadata, autoload=True, autoload_with=engine)
query = sqlalchemy.select([customers.columns.FirstName, 
                           customers.columns.LastName]).where(customers.columns.City.in_(['Rio de Janeiro', 'New York']))
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

[('Roberto', 'Almeida'), ('Michelle', 'Brooks')]

#### and, or, not

In [39]:
## SQL :SELECT * FROM customers WHERE City = 'Rio de Janeiro' AND NOT FirstName sex = 'Roberta'
    
customers = sqlalchemy.Table('customers', metadata, autoload=True, autoload_with=engine)
query = sqlalchemy.select([customers]).where(sqlalchemy.and_(customers.columns.City == "Rio de Janeiro",
                                                             customers.columns.FirstName != "Roberta")
                                            )
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

[(12, 'Roberto', 'Almeida', 'Riotur', 'Praça Pio X, 119', 'Rio de Janeiro', 'RJ', 'Brazil', '20040-020', '+55 (21) 2271-7000', '+55 (21) 2271-7070', 'roberto.almeida@riotur.gov.br', 3)]

#### order by

In [44]:
## SQL : SELECT * FROM customers ORDER BY City DESC, Country

customers = sqlalchemy.Table('customers', metadata, autoload=True, autoload_with=engine)
query = sqlalchemy.select([customers]).order_by(sqlalchemy.desc(customers.columns.City), customers.columns.Country)
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet[:3]

[(33, 'Ellie', 'Sullivan', None, '5112 48 Street', 'Yellowknife', 'NT', 'Canada', 'X1A 1N6', '+1 (867) 920-2233', None, 'ellie.sullivan@shaw.ca', 3),
 (32, 'Aaron', 'Mitchell', None, '696 Osborne Street', 'Winnipeg', 'MB', 'Canada', 'R3L 2B9', '+1 (204) 452-6452', None, 'aaronmitchell@yahoo.ca', 4),
 (49, 'Stanisław', 'Wójcik', None, 'Ordynacka 10', 'Warsaw', None, 'Poland', '00-358', '+48 22 828 37 39', None, 'stanisław.wójcik@wp.pl', 4)]

#### functions
other functions include avg, count, min, max…

In [48]:
##SQL : SELECT SUM(Total) FROM invoices 
    
invoices = sqlalchemy.Table('invoices', metadata, autoload=True, autoload_with=engine)
query = sqlalchemy.select([sqlalchemy.func.sum(invoices.columns.Total)])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

/usr/local/lib/python3.8/dist-packages/sqlalchemy/sql/sqltypes.py:660: SAWarning: Dialect sqlite+pysqlite does *not* support Decimal objects natively, and SQLAlchemy must convert from floating point - rounding errors and other issues may occur. Please consider storing Decimal numbers as strings or integers on this platform for lossless storage.
  util.warn(

[(Decimal('2328.60'),)]

#### group by

In [51]:
##SQL : SELECT SUM(Total) as Total, InvoiceDate FROM invoices GROUP BY InvoiceDate

invoices = sqlalchemy.Table('invoices', metadata, autoload=True, autoload_with=engine)
query = sqlalchemy.select([sqlalchemy.func.sum(invoices.columns.Total).label('Total'), 
                           invoices.columns.InvoiceDate]).group_by(invoices.columns.InvoiceDate)

ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet[:5]

[(Decimal('1.98'), datetime.datetime(2009, 1, 1, 0, 0)),
 (Decimal('3.96'), datetime.datetime(2009, 1, 2, 0, 0)),
 (Decimal('5.94'), datetime.datetime(2009, 1, 3, 0, 0)),
 (Decimal('8.91'), datetime.datetime(2009, 1, 6, 0, 0)),
 (Decimal('13.86'), datetime.datetime(2009, 1, 11, 0, 0))]

#### distinct

In [52]:
## SQL : SELECT DISTINCT state FROM censusSQLAlchemy :

invoices = sqlalchemy.Table('invoices', metadata, autoload=True, autoload_with=engine)
query = sqlalchemy.select([invoices.columns.CustomerId.distinct()])

ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet[:5]

[(1,), (2,), (3,), (4,), (5,)]

#### joins

In [57]:
artists = sqlalchemy.Table('artists', metadata, autoload=True, autoload_with=engine)
albums = sqlalchemy.Table('albums', metadata, autoload=True, autoload_with=engine)

### Automatic Join

In [61]:
query = sqlalchemy.select([artists.columns.Name, albums.columns.Title])
results = connection.execute(query).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(5)

    Name                                  Title
0  AC/DC  For Those About To Rock We Salute You
1  AC/DC                      Balls to the Wall
2  AC/DC                      Restless and Wild
3  AC/DC                      Let There Be Rock
4  AC/DC                               Big Ones

### Manual Join

In [66]:
query = sqlalchemy.select([artists, albums])
query = query.select_from(artists.join(albums, artists.columns.ArtistId == albums.columns.ArtistId))
results = connection.execute(query).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(5)

,ArtistId,Name,AlbumId,Title,ArtistId
0,1,AC/DC,1,For Those About To Rock We Salute You,1
1,2,Accept,2,Balls to the Wall,2
2,2,Accept,3,Restless and Wild,2
3,1,AC/DC,4,Let There Be Rock,1
4,3,Aerosmith,5,Big Ones,3

## Creating and Inserting Data into Tables

By passing the database which is not present, to the engine then sqlalchemy automatically creates a new database.

In [68]:
engine = sqlalchemy.create_engine('sqlite:///../SampleDBs/test.sqlite') #Create test.sqlite automatically
connection = engine.connect()
metadata = sqlalchemy.MetaData()

emp = sqlalchemy.Table('emp', metadata,
                       sqlalchemy.Column('Id', sqlalchemy.Integer()),
                       sqlalchemy.Column('name', sqlalchemy.String(255), nullable=False),
                       sqlalchemy.Column('salary', sqlalchemy.Float(), default=100.0),
                       sqlalchemy.Column('active', sqlalchemy.Boolean(), default=True)
                      )

metadata.create_all(engine) #Creates the table

In [69]:
#Inserting record one by one

query = sqlalchemy.insert(emp).values(Id=1, name='naveen', salary=60000.00, active=True) 
ResultProxy = connection.execute(query)

In [70]:
#Inserting many records at ones

query = sqlalchemy.insert(emp) 
values_list = [{'Id':'2', 'name':'ram', 'salary':80000, 'active':False},
               {'Id':'3', 'name':'ramesh', 'salary':70000, 'active':True}]
ResultProxy = connection.execute(query,values_list)

In [71]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

### Updating data in Databases

db.update(table_name).values(attribute = new_value).where(condition)

In [72]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

In [73]:
# Build a statement to update the salary of Id = 1 to to 100000
query = sqlalchemy.update(emp).values(salary = 100000)
query = query.where(emp.columns.Id == 1)
results = connection.execute(query)

In [74]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

#### Delete Table

db.delete(table_name).where(condition)

In [76]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

In [77]:
# Build a statement to delete where salary < 100000
query = sqlalchemy.delete(emp)
query = query.where(emp.columns.salary < 100000)
results = connection.execute(query)

In [78]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True

#### Dropping a Table

table_name.drop(engine) #drops a single table  
metadata.drop_all(engine) #drops all the tables in the database

In [36]:
Base = declarative_base()

Criação das Tabelas

In [37]:
class Edificio(Base):
    __tablename__ = "edificio"
    
    id_edificio = Column(Integer, Sequence('id_edificio_seq'), primary_key = True)
    nome = Column(String(100), index=True, nullable = True)
    ano_de_construcao = Column(String(100), index = True, nullable = True)
    endereco = Column(String(100), index = True, nullable = True)

In [38]:
estilo = relationship('Estilo', backref = 'edificio',lazy=True, cascade = "all, delete-orphan")
arquiteto = relationship('Arquiteto', backref = 'edificio', lazy = True, cascade = "all, delete-orphan")
categoria = relationship('CategoriaEdificio', backref = 'edificio', lazy = True,cascade = "all, delete-orphan")

In [39]:
class Estilo(Base):
    __tablename__="estilo"
    __table_args__ = (
        PrimaryKeyConstraint('id_edificio', 'estilo'),
    )
    id_edificio =Column(Integer,ForeignKey('edificio.id_edificio'))
    estilo = Column(String(100), index = True)

class Arquiteto(Base):
    __tablename__="arquiteto"
    __table_args__ = (
        PrimaryKeyConstraint('id_edificio', 'nome_arquiteto'),
    )
    id_edificio= Column(Integer,ForeignKey('edificio.id_edificio'))
    nome_arquiteto = Column(String(100), index = True)

class CategoriaEdificio(Base):
    __tablename__="categoria_edificio"
    __table_args__ = (
        PrimaryKeyConstraint('id_edificio', 'categoria'),
    )
    id_edificio = Column(Integer,ForeignKey('edificio.id_edificio'))
    categoria = Column(String(100), index = True)

In [40]:
engine = connect_db()
Edificio.__table__.create(bind=engine, checkfirst=True)
Estilo.__table__.create(bind=engine, checkfirst=True)
Arquiteto.__table__.create(bind=engine, checkfirst=True)
CategoriaEdificio.__table__.create(bind=engine, checkfirst=True)

In [41]:
db = connect_db()
Session = sessionmaker(bind=db)
session = Session()

Inserção dos Dados

In [42]:
session.add(Edificio(nome = 'Linked Hybrid', ano_de_construcao = '2009', endereco = 'Pequim - China'))
session.add(Edificio(nome = 'Casa Moby Dick', ano_de_construcao = '2003', endereco = 'Espoo - Finlândia'))
session.add(Edificio(nome = 'Apartamentos WoZoCo', ano_de_construcao = '1997', endereco = 'Amsterdã - Holanda'))
session.add(Edificio(nome = 'Casas Cubo', ano_de_construcao = '1984', endereco = 'Roterdã - Holanda'))
session.add(Edificio(nome = 'Museu Perot de Ciência Natural', ano_de_construcao = '2012', endereco = 'Dallas - Estados Unidos'))
session.commit()

In [43]:
session.add(CategoriaEdificio(id_edificio = 1, categoria = "Comércio"))
session.add(CategoriaEdificio(id_edificio = 2, categoria = "Exposição"))
session.add(CategoriaEdificio(id_edificio = 3, categoria = "Moradia"))
session.add(CategoriaEdificio(id_edificio = 4, categoria = "Comércio"))
session.add(CategoriaEdificio(id_edificio = 5, categoria = "Museu"))
session.commit()

In [44]:
session.add(Arquiteto(id_edificio = 1, nome_arquiteto = "Su Dong Xia"))
session.add(Arquiteto(id_edificio = 2, nome_arquiteto = "Paavo Seppo Aadolf"))
session.add(Arquiteto(id_edificio = 3, nome_arquiteto = "Norbert Ágoston Odd"))
session.add(Arquiteto(id_edificio = 4, nome_arquiteto = "Jere Petri Aulis"))
session.add(Arquiteto(id_edificio = 5, nome_arquiteto = "Jóhannes Amrit Bogdan"))
session.commit()

Exploração

In [45]:
session.query(Edificio).count()

10

In [46]:
deletar_arquiteto = session.query(Arquiteto).filter(Arquiteto.id_edificio==1).first()
session.delete(deletar_arquiteto)
session.commit()

In [47]:
import pandas as pd
df = pd.read_sql(session.query(Edificio).statement, session.bind)

In [48]:
df

,id_edificio,nome,ano_de_construcao,endereco
0,1,Linked Hybrid,2009,Pequim - China
1,2,Casa Moby Dick,2003,Espoo - Finlândia
2,3,Apartamentos WoZoCo,1997,Amsterdã - Holanda
3,4,Casas Cubo,1984,Roterdã - Holanda
4,5,Museu Perot de Ciência Natural,2012,Dallas - Estados Unidos
5,6,Linked Hybrid,2009,Pequim - China
6,7,Casa Moby Dick,2003,Espoo - Finlândia
7,8,Apartamentos WoZoCo,1997,Amsterdã - Holanda
8,9,Casas Cubo,1984,Roterdã - Holanda
9,10,Museu Perot de Ciência Natural,2012,Dallas - Estados Unidos

In [49]:
df.query("ano_de_construcao >= '2000'")

,id_edificio,nome,ano_de_construcao,endereco
0,1,Linked Hybrid,2009,Pequim - China
1,2,Casa Moby Dick,2003,Espoo - Finlândia
4,5,Museu Perot de Ciência Natural,2012,Dallas - Estados Unidos
5,6,Linked Hybrid,2009,Pequim - China
6,7,Casa Moby Dick,2003,Espoo - Finlândia
9,10,Museu Perot de Ciência Natural,2012,Dallas - Estados Unidos

In [50]:
df.query('endereco.str.contains("Holanda")', engine='python')

   id_edificio                 nome ano_de_construcao            endereco
2            3  Apartamentos WoZoCo              1997  Amsterdã - Holanda
3            4           Casas Cubo              1984   Roterdã - Holanda
7            8  Apartamentos WoZoCo              1997  Amsterdã - Holanda
8            9           Casas Cubo              1984   Roterdã - Holanda